Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཐམས་ཅད་མཁྱེན་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: I prostrate to the All-Knowing One.

source: གང་ལས་འཇིག་རྟེན་བླ་མ་བདེ་གཤེགས་ཐོས་པའི་སྒོ་ནས་རབ་སྙན་བརྟན་པའི་གསུང་ལྡན་གྱིས། །སེམས་ཅན་རྣམས་ལ་ཕན་པ་འབའ་ཞིག་བཞེད་ཕྱིར་བཤད་པ་རྣམ་པ་སྣ་ཚོགས་རང་ཉིད་ཀྱིས། །ལོག་པར་ལྟ་བའི་མུན་ནག་ཆེན་པོ་ཐིབས་པོར་འཐོམས་ཤིང་འཁྲུགས་པ་རྣམས་ལ་རབ་གསུངས་པ། །དེ་ཡི་མིང་ནི་ལས་རྣམ་བརྒྱ་པ་ཞེས་བྱ་ཡོངས་སུ་ཚང་བ་བདག་གིས་བཤད་ཀྱིས་ཉོན། །
en: Listen well, for I have heard Of a doorway whence we may discern The world-guru, Gone to Bliss, Who wishes nothing but our benefit, As he parcels out a full account To those who wandered in, confused, From the vast, bleak wood of wrongful views. His sacred speech, so sound and sweet— This sūtra—is The Hundred Deeds.

source: སྤྱི་སྡོམ་ནི།
en: A General Outline of the Text Part One:

source: ཁྱི་མོ་དང་ནི་ཤིང་རྟ་དང་། །ཀ་ཙང་ཀ་ལ་བྱམས་མི་སྡུག །བྱ་དང་འཕྱེ་བོ་གང་པོ་དང་། །བུ་རྣམས་དང་ནི་བརྒྱ་བྱིན་ནོ། །
en: “The Dog,” and Other Stories Part Two: “The Chariot,” and Other Stories Part Three: “The Story of Kacaṅkalā,” and Other Stories Part Four: “The Story of Maitrībala,” and Other Stories Part Five: “The Story of Virūpa ,” and Other Stories Part Six: “The Bird,” and Other Stories Part Seven: “The Story of Paṅgu,” and Other Stories Part Eight: “The Story of Pūrṇa,” and Other Stories Part Nine: “The Sons,” and Other Stories Part Ten: “Śakra,” and Other Stories

source: ཁྱི་མོ་མིག་ཆུང་རྫོགས་བྱེད་དང་། །སྒུར་གཉིས་འཆར་ཀ་རྒྱལ་མཚན་དང་། །བདེ་བྱེད་མ་དང་ནོར་བུའི་འོད། །སྣ་མའི་མེ་ཏོག་ང་བྱིན་དང་། །འདུས་མོ་དང་ནི་ཚེམ་བུ་མཁན། །ཁྱི་མོ་ཞེས་བྱ་བ་ནི།
en: 1. The Dog 2. The Story of Little Eyes 3. The Story of Pūraṇa 4. The Person with a Curving Spine: Two Stories 5. The Story of Udayin 6. Victory Banner 7. The Story of Kṣemā 8. The Story of Maṇiprabha 9. The Story of Sumati 10. Give It to Me! 11. The Story of She Who Gathers 12. The Tailor The Dog

source: དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན། ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ།
en: When the Blessed One was in Śrāvastī there lived a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—

source: རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་ཏེམུ་སྟེགས་ཅན་ལ་དགའོ། །
en: with wealth to rival Vaiśravaṇa’s—who was fond of philosophical extremists.

source: དེ་ནས་དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས། དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: When the time came for him to marry he took a wife, and they enjoyed themselves and coupled.

source: དེ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས་ཕྱིས་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས་
en: As they enjoyed themselves and coupled, one day his wife conceived.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ། མདོག་བཟང་བ་གསེར་གྱི་ཁ་དོག་ཅན། མགོ་བོ་གདུགས་ལྟར་འདུག་པ་ལག་པ་རིང་བ། དཔྲལ་བའི་དབྱེས་ཆེ་བ། སྣ་མཐོ་བ་སྣ་ལེགས་པ་སྨིན་མ་སྟུག་པ་ཞིག་བཙས་སོ། །
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, with glowing, golden skin, a well-rounded head, long arms, a broad brow, a fine and prominent nose, and eyebrows that met.

source: དེ་ནས་དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས། རིགས་དང་འཐུན་པར་མིང་བཏགས་ཏེ།
en: At the elaborate feast celebrating his birth they named him according to their clan.

source: འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ་མཚོའི་ནང་གི་པདྨ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared him on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་ནས་དེ་གང་གི་ཚེ་འགྲོ་ནུས་པར་གྱུར་པ་དེའི་ཚེ་དེ་རྩེར་གཞུག་པའི་ཕྱིར་ཕས། ཁྱི་གུ་མོ་ཞིག་ཁྱིམ་དུ་བཞག་གོ། །
en: Once he was able to walk, his father brought home a little puppy for him to play with.

source: ཁྱི་གུ་མོ་དེ་ཡང་གང་གི་ཚེ། གཞན་མུ་སྟེགས་པ་དག་མཐོང་བ་དེའི་ཚེ་ནི་རྒྱུག་སྟེ་ཟ་བར་བྱེད་ལ་གོས་རྣམས་ཀྱང་འདྲལ་བར་བྱེད་དོ། །
en: Any time the puppy saw philosophical extremists, she would run and bite at them, sometimes tearing their robes.

source: དེ་སྟེ་དགེ་སློང་དག་མཐོང་ན་ནི་དྲུང་དུ་འཇར་ཞིང་ལྕེས་རྐང་པ་ལ་བལྡགས་ཏེ། མཇུག་མ་དྲིལ་ནས་གཡས་ཕྱོགས་སུ་སྐོར་བ་བྱེད་དོ། །
en: But when she saw Buddhist monastics she would trot up, lick their feet, and circumambulate them clockwise while wagging her tail.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་། ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ་
en: The buddhas, the blessed ones, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity,

source: མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ་འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ།
en: fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers,

source: ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི་ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ནི་རྒུད་
en: “Who is in decline?

source: སུ་ནི་དར་
en: Who will flourish?

source: སུ་ནི་ཕོངས་ཤིང་འདུག །
en: Who is destitute?

source: སུ་ནི་ཉམ་ང་བར་གྱུར་
en: Who is in a dreadful state?

source: སུ་ནི་གནོད་པ་དང་ལྡན།
en: Who is being harmed?

source: སུ་ནི་ཕོངས་པ་དང་ཉམ་ང་བ་དང་གནོད་པ་དང་ལྡན་
en: Who is destitute, in a dreadful state, and being harmed?

source: སུ་ནི་ངན་སོང་དུ་གཞོལ་
en: Who is veering toward the lower realms?

source: སུ་ནི་ངན་སོང་དུ་འབབ་
en: Who is descending through the lower realms?

source: སུ་ནི་ངན་སོང་དུ་བབ་
en: Who has descended to the lower realms?

source: སུ་ནི་ངས་ངན་སོང་ནས་ཕྱུང་སྟེམཐོ་རིས་དང་ཐར་པ་དང་འབྲས་བུ་ལ་གཞག་པར་བྱ།
en: Whom shall I pull up from the lower realms, and establish in the resultant state of heaven and liberation?

source: སུ་ནི་ཉེས་པར་སྤྱོད་པའི་འདམ་དུ་བྱིང་བ་ལས་ལག་པ་ནས་དྲང་བར་བྱ།
en: Whom, mired in misdeeds, shall I lift up by the hand?

source: སུ་ནི་འཕགས་པའི་ནོར་བདུན་མེད་པ་ལས་འཕགས་པའི་ནོར་བདུན་གྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་གཞུག་པར་བྱ།
en: Whom, lacking the seven jewels of the noble ones, shall I lead to command of the seven jewels of the noble ones?

source: སུ་ནི་དགེ་བའི་རྩ་བ་རྣམས་མ་བསྐྱེད་པ་ལས་བསྐྱེད་པར་བྱ།
en: Whom, not having produced roots of virtue, shall I lead to produce them?

source: སུ་ནི་དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་ཟིན་པ་ལས་ཡོངས་སུ་སྨིན་པར་བྱ།
en: Whom, having already produced roots of virtue, shall I lead to ripen their roots of virtue?

source: སུ་ནི་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་སྨིན་ཟིན་པ་ལས་ཡེ་ཤེས་ཀྱི་མཚོན་གྱིས་བརྟོལ་བར་བྱ།
en: Whom, having already ripened their roots of virtue, shall I slice open with the blade of wisdom?

source: སུ་ལ་ནི་སངས་རྒྱས་བྱུང་བས་བརྒྱན་པའི་འཇིག་རྟེན་འབྲས་བུ་དང་བཅས་པར་བྱ་སྙམ་དུ་ཡེ་ཤེས་གཟིགས་པ་འཇུག་གོ། །
en: For whom shall I cause this world, adorned with a buddha’s presence, to be fruitful?”

source: རྒྱ་མཚོ་ཆུ་སྲིན་རྣམས་ཀྱི་གནས། །དུས་རླབས་ཡོལ་བར་འགྱུར་ཡང་སྲིད། །
en: The ocean, home of creatures fierce, Could fail to send its tides on time.

source: གདུལ་བར་བྱ་བའི་སྲས་རྣམས་ལ། །སངས་རྒྱས་དུས་ལས་ཡོལ་བ་མེད། །
en: But when the time has come to tame Their offspring, buddhas never fail.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཇི་ལྟར་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་པ་
en: Just as the buddhas, the blessed ones, regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night—

source: དེ་བཞིན་དུ། ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱང་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་ཉན་ཐོས་ཀྱི་མིག་གིས་འཇིག་རྟེན་ལ་ལྟ་བར་བྱེད་དེ།
en: so too the great disciples of the buddhas regard the world with disciples’ eyes six times throughout the day and night—three times by day and three times by night.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཉན་ཐོས་ཀྱི་མིག་གིས་འཇིག་རྟེན་ལ་བལྟས་ན། ཁྱིམ་བདག་འཁོར་དང་བཅས་པ་གདུལ་བའི་དུས་ལ་བབ་པར་མཐོང་ནས།
en: When Venerable Śāriputra regarded the world with his disciple’s eyes, he knew that the time had come to tame the householder and his retinue.

source: སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་བགོས་ཏེ། ལྷུང་བཟེད་ཐོགས་ནས་མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་སོང་ངོ་། །
en: In the morning he donned his lower garment and Dharma robes, and, carrying his alms bowl, he went for alms in Śrāvastī.

source: དེ་མཐར་གྱིས་བསོད་སྙོམས་རྒྱུ་བ་ལས་ཁྱིམ་བདག་དེའི་ཁྱིམ་ག་ལ་བ་དེར་སོང་བ་དང་།
en: As he went for alms, Śāriputra eventually came to the home of that householder.

source: ཁྱི་མོ་དེས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཐག་རིང་པོ་ཞིག་ནས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ཤིན་ཏུ་རིངས་པར་ལངས་ཏེ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ག་ལ་བ་དེར་སོང་ནས། ཇི་ལྟར་དགེ་སློང་གཞན་དག་གི་ཐད་དུ་འགྲོ་བ་དེ་བཞིན་དུ།
en: As soon as the dog saw him from a distance, she jumped up and ran right up to Śāriputra, just as she had with the other monks.

source: ཆེས་གུས་པར་ལྕེས་རྐང་པ་ལ་བལྡགས་ཏེ། མཇུག་མ་དྲིལ་ནས་ལན་གསུམ་སྐོར་བ་བྱེད་དོ། །
en: She very respectfully licked his feet and circumambulated him three times while wagging her tail.

source: དེ་ཡང་ཁྱིམ་བདག་དེས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བསམས་པ།
en: The householder saw all this and thought,

source: མ་ལ་འདི་ལྟར། ཁྱི་མོ་ལོག་པར་ལྟུང་བའི་ལུས་ཅན་འདི་ཡང་
en: “My! This one has fallen so low as to possess the body of a dog.

source: འདི་ལ་དེ་ལྟ་བུའི་བཀུར་སྟི་བྱེད་པར་སེམས་པ་ལས་ན། དགེ་སློང་འདི་ནི་བདག་ཉིད་ཆེན་པོ་ཞིག་ཡིན་གོར་མ་ཆག་སྙམ་དུ་བསམས་ཏེ།
en: If even she thinks to pay him such esteem, then surely this monk is a great being.

source: མ་ལ་བདག་གིས་ཀྱང་དགེ་སློང་འདི་སྤྱན་དྲངས་ལ་བཤོས་གསོལ་ལོ་
en: I should invite this monk and offer him food.”

source: སྙམ་དུ་བསམས་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེའདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Reflecting in this way he approached Venerable Śāriputra, bowed down at Śāriputra’s feet, and said,

source: བཙུན་པ་ཤཱ་རིའི་བུ་འོ་ན་འདི་ཉིད་དུ་བཤོས་གསོལ་དུ་ཅི་གནང་ཞེས་བྱས་ནས།
en: “Lord Śāriputra, whatever food you need, please take it here.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཁྱིམ་བདག་དེ་ལ་ཅང་མི་ཟེར་བས་གནང་ངོ་། །
en: Venerable Śāriputra assented by his silence.

source: དེ་ནས་ཁྱིམ་བདག་དེས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཅང་མི་ཟེར་བས་གནང་བར་རིག་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་སྟན་བཤམས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Understanding that by his silence Venerable Śāriputra had given his assent, the householder then prepared a seat for Venerable Śāriputra and said,

source: བཙུན་པ་ཤཱ་རིའི་བུ་གདན་བཤམས་པ་ལ་བཞུགས་སུ་གསོལ།
en: “Venerable Śāriputra, please sit upon the seat that I have prepared,”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སྟན་བཤམས་པ་ལ་འདུག་གོ། །
en: whereupon Venerable Śāriputra sat on the seat prepared for him.

source: དེ་ནས་ཁྱིམ་བདག་དེས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བདེ་བར་འདུག་པར་རིག་ནས། རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ཏེ། ཅི་འདོད་པ་བསྟབས་སོ། །
en: Once the householder knew that Venerable Śāriputra was comfortably seated, by his own hand he contented him with many good, wholesome foods, proffering all that he wished.

source: རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་རྣམ་གྲངས་དུ་མས་ཚིམ་པར་བྱས་ཏེ། ཅི་འདོད་པ་བསྟབས་པའི་འོག་ཏུ་སྡེར་ནི་གྱུ། ལྷུང་བཟེད་ནི་བཀྲུས་པར་རིག་ནས། ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: After he had contented him with many different kinds of good, wholesome foods by his own hand, and had proffered all that he wished, once he knew that Venerable Śāriputra had finished eating and that his bowl had been taken away and his hands washed, he sat before him to listen to the Dharma.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཁྱིམ་བདག་དེ་འཁོར་དང་བཅས་པའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་ཁམས་དང་རང་བཞིན་རྟོགས་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ
en: Venerable Śāriputra directly apprehended the thoughts, habitual tendencies, temperament, and nature of the householder and his retinue, and taught them the Dharma accordingly.

source: དེ་ཐོས་ནས་ཁྱིམ་བདག་དེ་འཁོར་དང་བཅས་པས་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ
en: When they heard it, the householder and his retinue destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry.

source: དེས་བདེན་པ་མཐོང་ནས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་སོ། །
en: Having seen the truths, they went for refuge and took the fundamental precepts.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཁྱིམ་བདག་དེ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག ། ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པ་དགའ་བར་བྱས་ནས་སྟན་ལས་ལངས་ཏེ་སོང་ངོ་། །
en: After Venerable Śāriputra had instructed, encouraged, inspired, and delighted the householder with a discourse on the Dharma, he rose from his seat and departed.

source: ཁྱིམ་བདག་དེ་ཡང་བདེན་པ་མཐོང་བར་གྱུར་ནས། སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱེད་དོ། །དེའི་ཁྱིམ་དེ་སློང་བའི་སྐྱེ་བོ་རྣམས་ཀྱི་ཆུ་དོང་དང་འདྲ་བར་གྱུར་ཏོ། །
en: Having seen the truths, the householder began to give gifts and make merit such that his home became like an open well for those in need.

source: ཁྱིམ་བདག་དེས་ཀྱང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཡང་དང་ཡང་དུ་ཁྱིམ་གྱི་ནང་དུ་བཤོས་གསོལ་བར་བྱེད་དོ། །
en: The householder invited Śāriputra to take food at his home again and again.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་ཁྱིམ་བདག་དེས་ཁྱི་མོ་དེ་ལ་ཁ་ཟས་བྱིན་ནས་ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: Venerable Śāriputra and the householder would give food to the dog, and the householder would sit before Venerable Śāriputra to listen to the Dharma.

source: ཁྱི་མོ་དེ་ཡང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་མདུན་དུ་འདུག་ནས་ཆོས་ཉན་ཏོ། །
en: The dog too would sit down before Venerable Śāriputra and listen to the Dharma.

source: དེ་ནས་ཁྱིམ་བདག་དེས་བསམས་པ་བདག་གིས་ལེགས་པ་འདི་ལྟ་བུ་རྟོགས་པ་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་ཁྱི་མོ་འདིའི་མཐུ་ལས་བྱུང་བ་ཡིན་ནོ། །སྙམ་དུ་རིག་གོ། །
en: The householder reflected, “Such good things I have realized, and all on account of this dog!”

source: རིག་ནས་ཀྱང་དེ་ལ་ཤིན་ཏུ་སྐྱོང་བར་བྱེད་དོ། །
en: Realizing this, he took very good care of her.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱི་མོ་དེ་ནད་ཀྱིས་ཐེབས་ནས། ཤཱ་རིའི་བུས་དེ་ལ་སྨྲས་པ།
en: One day the dog fell ill, and Śāriputra said to her,

source: བུ་འདི་ལྟར་འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་པའོ། །
en: “And so it is, child: All conditioned things are impermanent.

source: འདུ་བྱེད་ཐམས་ཅད་ནི་སྡུག་བསྔལ་བའོ། །
en: All conditioned things are suffering.

source: ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པའོ། །
en: All phenomena are selfless.

source: མྱ་ངན་ལས་འདས་པ་ནི་ཞི་བའོ། །
en: Nirvāṇa is peace.

source: ང་ལ་སེམས་དགའ་བར་གྱིས་ཤིག་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་འབྲལ་བར་འགྱུར་ཡང་སྲིད་དོ་
en: Let your mind be filled with joy at the thought of me, and you may even be released from rebirth in the animal realm.”

source: ཞེས་སྨྲས་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སོང་ངོ་། །
en: With that, Venerable Śāriputra departed.

source: དེ་སོང་ནས་རིང་པོ་མ་ལོན་པར་ཁྱི་མོ་དེ་ཡང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་སེམས་དགའ་བར་གྱུར་ནས་ཤིའོ། །
en: Not long after he had gone, the dog died, filled with joy at the thought of Venerable Śāriputra.

source: དེ་ཤི་འཕོས་ཏེ་འདས་ནས་ཁྱིམ་དེ་ཉིད་དུ་ཁྱིམ་བདག་དེའི་ཆུང་མ་ཆེན་མའི་མངལ་དུ་སྐྱེས་སོ། །
en: After she died, she took rebirth in the same house, in the womb of the householder’s foremost wife.

source: དེ་ཤི་བའི་ཚེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སླར་ཁྱིམ་དེར་འོངས་ནས། ཁྱིམ་བདག་གིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བསྙད་དེ།
en: When the dog died, Venerable Śāriputra returned to the house, where the householder informed him,

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱི་མོ་དེ་གུམ་ལགས་སོ་ཞེས་བྱས་སོ། །
en: “Lord Śāriputra, our dog has passed away.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ།
en: Venerable Śāriputra instructed,

source: ཁྱི་མོ་དེའི་རོ་དེ་ཕྱོགས་དབེན་པ་ཞིག་ཏུ་ཞོག་ཤིག་དང་། རུས་པ་དེ་དག་ཕྱིས་དེ་ཉིད་ལ་ཕན་འདོགས་པར་འགྱུར་རོ། །
en: “Keep the dog’s body in a secluded place,” “for those bones will be of benefit to her later on.”

source: ཁྱིམ་བདག་གིས་སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུས་ཇི་སྐད་བཀའ་སྩལ་པ་བཞིན་དུ་བགྱིའོ་ཞེས་སྨྲས་ནས། ཁྱིམ་བདག་དེས་ཁྱི་རོ་དེ་གང་དུ་སུས་ཀྱང་མི་མཐོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཕྱོགས་ཤིག་ཏུ་བཞག་གོ། །
en: “As you wish, Lord Śāriputra,” said the householder, and the householder put the dog’s dead body in a place where no one would see it.

source: དེ་ནས་ཁྱིམ་བདག་གི་ཆུང་མ་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་བྱུང་སྟེ། བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་མདོག་བཟང་བ་གསེར་གྱི་ཁ་དོག་ཅན་མགོ་བོ་གདུགས་ལྟར་འདུག་པ། ལག་པ་རིང་བ་དཔྲལ་བའི་དབྱེས་ཆེ་བ་སྣ་མཐོ་བ་སྣ་ལེགས་པ་སྨིན་མ་སྟུག་པ་ཞིག་བཙས་སོ། །
en: After nine or ten months had passed, the householder’s wife gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, with glowing, golden skin and a well-rounded head, long arms, a broad brow, a fine and prominent nose, and eyebrows that met.

source: དེ་ནས་དེའི་བཙས་སྟོན་ཡང་རྒྱས་པར་བྱས་ནས། རིགས་དང་འཐུན་པའི་མིང་བཏགས་ཏེ།
en: At the elaborate feast celebrating her birth they named her according to their clan.

source: འོ་མ་དང་མར་དང་ཞོ་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ། མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared her on milk, yogurt, butter, ghee, and milk solids, and she flourished like a lotus in a lake.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེན་མོར་གྱུར་པ་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ།
en: When she had grown, Venerable Śāriputra told her,

source: བུ་འདུག་ལ་ཆོས་ཉོན་ཅིག་ཅེས་བྱས་ན། དེ་བྱད་གཟུགས་དང་ལང་ཚོའི་རྒྱགས་པས་དྲེགས་ནས་ཕན་ཚུན་དུ་གཡེངས་ཏེ་ཆོས་ཉན་དུ་མི་བཏུབ་བོ། །
en: “Child, sit and listen to the Dharma,” but she had become arrogant on account of her well-proportioned shape and youthfulness, and was so distracted that she was unable to listen to the Dharma.

source: དེ་ནས་ཕྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་དེ་ཤེད་བྱེ་བར་རིག་ནས
en: One day Venerable Śāriputra recognized how to uncover her potential.

source: ཁྱི་མོའི་རུས་བུ་དེ་དེ་ཉིད་ཀྱི་མདུན་དུ་བཞག་སྟེ། ཅི་ནས་ཀྱང་བུ་མོ་དེས་ཚེ་རབས་དྲན་པར་འགྱུར་བ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབས་ནས། ཚེ་རབས་དྲན་མ་ཐག་ཏུ་བུ་མོ་དེ་ཤས་ཆེར་སྐྱོ་བ་སྐྱེས་སོ། །
en: He set the bones of the dog in front of her, and blessed the young woman in such a way that she remembered her former lives.

source: དེ་སྐྱོ་བ་སྐྱེས་ནས་བསམས་པ། འཕགས་པ་ཤཱ་རིའི་བུ་ནི། བདག་ལ་དཀའ་བ་བྱེད་བྱེད་པ་ཡིན་པ་ལྟ་ཞིག་སྟེ།
en: Recalling her former lives, the young woman was overcome with grief and thought, “Look at the difficult task Noble Śāriputra has done for me!

source: འདི་ལས་བརྟེན་ནས། བདག་གིས་དུད་འགྲོའི་སྐྱེ་གནས་སྤངས་སོ་སྙམ་དུ་རིག་ནས།
en: Thanks to him I have been freed from the realms of animal birth.”

source: དགའ་བ་སྐྱེས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་མདུན་དུ་འདུག་གོ། །
en: At this thought she was filled with happiness, and sat before Venerable Śāriputra to listen to the Dharma.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་དེའི་བསམ་པ་དང་བག་ལ་ཉལ་དང་། ཁམས་དང་རང་བཞིན་རྟོགས་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: Then Venerable Śāriputra, directly apprehending her thoughts, habitual tendencies, temperament, and nature, taught her the Dharma accordingly.

source: དེ་ཐོས་ནས་བུ་མོ་དེས་སྟན་དེ་ཁོ་ན་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Hearing it, the young woman destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where she sat.

source: དེས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Having seen the truths, she rose from her seat, drew down the right shoulder of her upper garment, bowed to Venerable Śāriputra with her palms together, and implored him,

source: བཙུན་པ་ཤཱ་རིའི་བུ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་
en: “Lord Śāriputra, if permitted, I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: དགེ་སློང་མའི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན་བདག་ཀྱང་། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་འཚལ་ལོ། །
en: I too wish to practice the holy life in the presence of the Blessed One.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་དེའི་ཕ་མ་ལ་དད་པ་སྨྲས་ནས། སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་ལ་གཏད་དེ་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོས་དེ་རབ་ཏུ་ཕྱུང་ནས་བསྙེན་པར་རྫོགས་པར་བྱས་ཏེ། དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: Venerable Śāriputra told her parents of her faith and then presented her to Mahā­prajāpatī, who led her to go forth as a novice, ordained her, and gave her instruction.

source: དེས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Casting away all afflictive emotions through diligence, practice, and effort, she manifested arhatship.

source: དེ་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས། གསེར་དང་བོང་རྡོར་མཉམ་པ་ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ་
en: As an arhat, free of the attachments of the three realms, her mind regarded gold no differently than filth, and the palms of her hands as like space itself.

source: ཙན་དན་སྦངས་པ་ལྟ་བུར་བསིལ་བར་གྱུར་པ་
en: She became cool like wet sandalwood.

source: རིག་པས་མ་རིག་པའི་སྒོ་ངའི་སྦུབས་བཅོམ་པ་
en: Her insight crushed ignorance like an eggshell.

source: རིག་པ་དང་མངོན་པར་ཤེས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་
en: She achieved the insights, superknowledges, and discriminations.

source: སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་
en: She had no regard for worldly profit, passion, or acclaim.

source: ཕྱོགས་པ་དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་། གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: She became an object of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: དེ་དགྲ་བཅོམ་པར་གྱུར་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་སྔོན་གྱི་དྲིན་དྲན་ཏེ། ཡང་དང་ཡང་དུ་ཐད་དུ་འགྲོ་ཞིང་རྐང་པ་ལ་ཕྱག་འཚལ་ནས།
en: Now an arhat, she remembered Venerable Śāriputra’s previous kindness and approached him again and again, prostrating herself at his feet and saying,

source: འདི་སྐད་དུ་འཕགས་པ་ཤཱ་རིའི་བུ་ལས་བརྟེན་ཏེ་བདག་གིས་དུད་འགྲོའི་སྐྱེ་གནས་སྤངས་ནས། ཡོན་ཏན་འདི་ལྟ་བུ་དག་ཀྱང་ཐོབ་པར་གྱུར་པས་ན།
en: “Thanks to Noble Śāriputra, I was freed from the realms of animal birth and achieved great virtues.

source: འཕགས་པ་ནི་བདག་ལ་དཀའ་བ་མཛད་མཛད་པ་ལགས་སོ་ཞེས་ཟེར་རོ། །
en: It is all due to the difficult task the noble one has done for me.”

source: དེ་ཡང་དང་ཡང་དུ་ཟེར་བ་དགེ་སློང་མང་པོས་ཐོས་ནས་ཐོས་མ་ཐག་ཏུ་དེ་དག་གིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་དྲིས་པ།
en: Many monks overheard her saying this over and over again, and immediately asked Venerable Śāriputra,

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དགེ་སློང་མ་འདིས་ཅི་ལས་བསམས་ཏེདེ་ཡང་དང་ཡང་དུ་དེ་སྐད་མཆི།
en: “Venerable Śāriputra, what is this nun thinking, saying this over and over again?”

source: ཁྱེད་ཀྱིས་ཁྱིམ་བདག་འདིའི་ཁྱིམ་ན་ཁྱི་མོ་ཞིག་འདུག་པ་མཐོང་ངམ།
en: “Did you see the puppy at the householder’s home?”

source: དེ་དག་གིས་སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་མཐོང་ངོ་། །
en: “Yes, Lord Śāriputra, we did,” they replied.

source: དེ་ཁོ་ནས་བདག་ལ་དགའ་བའི་སེམས་བསྐྱེད་ནས་ཤི་སྟེ་འདས་པ་དང་། ཁྱིམ་བདག་དེ་ཉིད་ཀྱི་ཁྱིམ་དུ་སྐྱེས་ཏེ།
en: “The very same one died filled with joy at the thought of me and was reborn in the home of that householder.

source: དེས་སྔོན་གྱི་ཚེ་རབས་རྗེས་སུ་དྲན་ནས། སྔོན་གྱི་དྲིན་གཟོ་བའི་ཕྱིར་བདག་ལ་དེ་སྐད་ཅེས་ཟེར་རོ། །
en: Now that she remembers her former lives, she speaks these words to me to acknowledge that previous kindness.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་ཞུས་པ། བཙུན་པ་དགེ་སློང་མ་འདིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་སྔོན་ཁྱིར་སྐྱེས་ལགས།
en: The monks inquired of the Blessed One, “Lord, what was the action this nun performed that ripened into her birth as a dog?
